Documents/бит_УстановкаИзменениеУслугПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_УстановкаИзменениеУслугПоЛС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КоличествоЕдиницПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимПотребления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ШаблоныУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ШаблоныУслуг</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийУстановкаИзменениеУслугПоЛС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугиНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеУслугНаЛицевойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/бит_УстановкаИзменениеУслугПоЛС/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем Шаблон Экспорт;                          // Таблица значений, срез последних регистра сведений бит_ШаблоныУслуг.

Перем мВалютаРегламентированногоУчета Экспорт; // Хранит валюту регламентированного учета.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на. 
// Экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// По переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
		
	// Получить экземпляр документа на печать
	Если ИмяМакета = "" Тогда
		ТабДокумент = "";//Печать();
	КонецЕсли;
	
КонецПроцедуры // Печать()
	
#КонецЕсли

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура();
	
КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет табличную часть "ЛицевыеСчета" срезом последних регистра сведений бит_СведенияПоУслугамЛС.
//
Процедура ЗаполнитьПоследнимиЗначениями() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать,
	|	бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Период, ЛицевойСчет = &ЛицевойСчет) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("Период"		, ?(ЭтоНовый(), Дата, МоментВремени()));
	Запрос.УстановитьПараметр("ЛицевойСчет"	, ЛицевойСчет);
	
	Результат 	= Запрос.Выполнить();
	Выборка 	= Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ЛицевыеСчета.Добавить();
		НоваяСтрока.Услуга 						= Выборка.Услуга;
		НоваяСтрока.Поставщик 					= Выборка.Поставщик;
		НоваяСтрока.РежимПотребления 			= Выборка.РежимПотребления;
		НоваяСтрока.СпособРасчета 				= Выборка.СпособРасчета;
		НоваяСтрока.КоличествоЕдиницПотребления = Выборка.КоличествоЕдиницПотребления;
	КонецЦикла;
	
КонецПроцедуры

// Процедура выполняет заполнение табличной части документа.
//
Процедура ЗаполнитьЛицевымиСчетами() Экспорт
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.Текст = 
	"ВЫБРАТЬ
	|	бит_ШаблоныУслугСрезПоследних.Здание
	|ПОМЕСТИТЬ Шаблон
	|ИЗ
	|	РегистрСведений.бит_ШаблоныУслуг.СрезПоследних(&МоментВремени, Услуга = &Услуга) КАК бит_ШаблоныУслугСрезПоследних
	|ГДЕ
	|	бит_ШаблоныУслугСрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_ШаблоныУслугСрезПоследних.Здание
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет,
	|	бит_ЛицевыеСчета.Здание,
	|	бит_ЛицевыеСчета.Квартира,
	|	бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица
	|ПОМЕСТИТЬ ЛицевыеСчета
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Таб.Здание
	|			ИЗ
	|				Шаблон КАК Таб) 
	//++АнисимоваМВ 1бит 11.11.2024 восстановление после сбоя
	|   И НЕ бит_ЛицевыеСчета.Архивный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЛицевыеСчета.ЛицевойСчет,
	|	ВЫБОР
	|		КОГДА бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления ЕСТЬ NULL 
	|			ТОГДА &РежимПотребления
	|		ИНАЧЕ бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления
	|	КОНЕЦ КАК РежимПотребления,
	|	бит_СведенияПоУслугамЛССрезПоследних.Поставщик,
	|	ВЫБОР
	|		КОГДА бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета ЕСТЬ NULL 
	|			ТОГДА &СпособРасчета
	|		ИНАЧЕ бит_СведенияПоУслугамЛССрезПоследних.СпособРасчета
	|	КОНЕЦ КАК СпособРасчета,
	|	бит_СведенияПоУслугамЛССрезПоследних.КоличествоЕдиницПотребления,
	|	&Услуга КАК Услуга,
	|	ЛицевыеСчета.Здание,
	|	ЛицевыеСчета.Улица
	|ИЗ
	|	ЛицевыеСчета КАК ЛицевыеСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|				&МоментВремени,
	|				Услуга = &Услуга
	|					И Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)) КАК бит_СведенияПоУслугамЛССрезПоследних
	|		ПО ЛицевыеСчета.ЛицевойСчет = бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЛицевыеСчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Шаблон";
	
	ПостроительЗапроса.Параметры.Вставить("МоментВремени"	, КонецДня(Дата));
	ПостроительЗапроса.Параметры.Вставить("Услуга"			, Услуга);
	ПостроительЗапроса.Параметры.Вставить("РежимПотребления", Услуга.ОсновнойРежимПотребления);
	ПостроительЗапроса.Параметры.Вставить("СпособРасчета"	, Услуга.ОсновнойСпособРасчета);
	
	ПостроительЗапроса.ЗаполнитьНастройки();
	
	Если ЗначениеЗаполнено(Здание) Тогда
		
		ПостроительЗапроса.Отбор.Добавить("Здание");
		ПостроительЗапроса.Отбор.Здание.Установить(Здание, Истина);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Улица) Тогда
		
		ПостроительЗапроса.Отбор.Добавить("Улица");
		ПостроительЗапроса.Отбор.Улица.Установить(Улица, Истина);
		
	КонецЕсли; 
	
	ПостроительЗапроса.Выполнить();
	Выборка = ПостроительЗапроса.Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ЛицевыеСчета.Добавить();
		НоваяСтрока.ЛицевойСчет 				= Выборка.ЛицевойСчет;
		НоваяСтрока.Поставщик					= Выборка.Поставщик;
		НоваяСтрока.РежимПотребления			= Выборка.РежимПотребления;
		НоваяСтрока.СпособРасчета				= Выборка.СпособРасчета;
		НоваяСтрока.Услуга						= Выборка.Услуга;
		НоваяСтрока.КоличествоЕдиницПотребления	= Выборка.КоличествоЕдиницПотребления;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Процедура выполняет проверку заполнения шапки и таб. частей.
//
// Параметры:
// Отказ - булево.
// Заголовок  – Строка.
Процедура ПроверкаРеквизитов(Отказ,Заголовок)
	
	// проверим заполнение шапки
	СтруктураОбязательныхПолей = Новый Структура;
	//СтруктураОбязательныхПолей.Вставить("Улица");
	//СтруктураОбязательныхПолей.Вставить("Здание");
	Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета Тогда
		СтруктураОбязательныхПолей.Вставить("Услуга");
	Иначе
		СтруктураОбязательныхПолей.Вставить("ЛицевойСчет");
	КонецЕсли;
	
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,  СтруктураОбязательныхПолей,   Отказ, Заголовок);
	
КонецПроцедуры //ПроверкаРеквизитов()

// Проверяет правильность заполнения строк табличной части "Услуги".
//
// Параметры: 
//  ТаблицаУслуги - результат запроса, содержащий данные для проведения и проверки ТЧ Услуги.
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке.
//  Отказ                     - флаг отказа в проведении.
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиУслуги(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	ИмяТабличнойЧасти = "ЛицевыеСчета";
	
	// Укажем, что надо проверить:
	СтруктураОбязательныхПолей = Новый Структура();
	СтруктураОбязательныхПолей.Вставить("Поставщик");
	СтруктураОбязательныхПолей.Вставить("РежимПотребления");
	СтруктураОбязательныхПолей.Вставить("СпособРасчета");
	Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета Тогда
		СтруктураОбязательныхПолей.Вставить("ЛицевойСчет");
	Иначе
		СтруктураОбязательныхПолей.Вставить("Услуга");
	КонецЕсли;
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Для того,чтобы при проведении не выдавать стандартное сообщение. 
	// О том что запись не верна, в случае если значения измерений повторяются,
	//	Будем проверять сами.
	СтруктураРеквизитов = Новый Структура;
	Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета Тогда
		СтруктураРеквизитов.Вставить("ЛицевойСчет");
	Иначе
		СтруктураРеквизитов.Вставить("Услуга");
	КонецЕсли;
	
	бит_ОбщегоНазначения.ПроверитьДублированиеСтрокВТабЧастиПоНаборуРеквизитов(ЭтотОбъект, "ЛицевыеСчета", СтруктураРеквизитов, Отказ);
	
	// БИТ_ЖКХ 
	// Убран закоментированый участок кода.
	
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиУслуги()

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
// Параметры: 
//  РезультатЗапросаПоУслугам - результат запроса по табличной части "Услуги",
//  СтруктураШапкиДокумента   - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке.
//
// Возвращаемое значение:
//  Сформированная таблиица значений.
//
Функция ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента)
	
	ТаблицаУслуги = РезультатЗапросаПоУслугам.Выгрузить();
	
	Возврат ТаблицаУслуги;
	
КонецФункции // ПодготовитьТаблицуСтавок()

// Процедура выполняет подготовку табличных частей документа для проведения и заполнения.
//
// Параметры :
//
//  ТаблицаЛицевыеСчета     - переменная, хранит таблицу лицевых счетов.
//  СтруктураШапкиДокумента - структура, содержащая рексвизиты шапки документа и результаты запроса по шапке.
//
Процедура ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаЛицевыеСчета) Экспорт
	
	// Получим необходимые данные для проведения и проверки заполенения данные по табличной части "Услуги".
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("РежимПотребления"	, "РежимПотребления");
	СтруктураПолей.Вставить("Поставщик"      	, "Поставщик");
	СтруктураПолей.Вставить("СпособРасчета"     	, "СпособРасчета");
	Если ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета Тогда
		СтруктураПолей.Вставить("Услуга", "Ссылка.Услуга");
		СтруктураПолей.Вставить("ЛицевойСчет", "ЛицевойСчет");
	Иначе
		СтруктураПолей.Вставить("Услуга", "Услуга");
		СтруктураПолей.Вставить("ЛицевойСчет", "Ссылка.ЛицевойСчет");
	КонецЕсли;
	
	СтруктураПолей.Вставить("КоличествоЕдиницПотребления"     	, "КоличествоЕдиницПотребления");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолей);
	
	// Подготовим таблицы услуг для проведения.
	ТаблицаЛицевыеСчета = ПодготовитьТаблицуУслуг(РезультатЗапросаПоУслугам, СтруктураШапкиДокумента);
	
КонецПроцедуры	

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаЛицевыеСчета,Отказ,Заголовок)
	
	НаборЗаписейСведенияПоУслугам = Движения.бит_СведенияПоУслугамЛС;
	// БИТ_ЖКХ 
	// Удален закоментированый участок кода.
	
	Для Каждого ТекСтрока Из ТаблицаЛицевыеСчета Цикл
		СтрокаДвижений = НаборЗаписейСведенияПоУслугам.Добавить();
		СтрокаДвижений.Период		= СтруктураШапкиДокумента.Дата;
		СтрокаДвижений.ЛицевойСчет	= ТекСтрока.ЛицевойСчет;
		СтрокаДвижений.Услуга		= ТекСтрока.Услуга;
		СтрокаДвижений.РежимПотребления= ТекСтрока.РежимПотребления;
		СтрокаДвижений.Поставщик	= ТекСтрока.Поставщик;
		СтрокаДвижений.СпособРасчета = ТекСтрока.СпособРасчета;
		СтрокаДвижений.Использовать = Перечисления.ДаНет.Да;
		СтрокаДвижений.КоличествоЕдиницПотребления = ТекСтрока.КоличествоЕдиницПотребления;
	КонецЦикла;
	// КонецЕсли;
	
КонецПроцедуры //ДвиженияПоРегистрам()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем ТаблицаЛицевыеСчета; // Хранит таблицу лицевых счетов.
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки.
	Если бит_ОбщегоНазначения.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект) Тогда
		Возврат
	КонецЕсли;
	
	ПроверкаРеквизитов(Отказ,Заголовок);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента, ТаблицаЛицевыеСчета);
	
	ПроверитьЗаполнениеТабличнойЧастиУслуги(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	// Выполним движения.
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаЛицевыеСчета,Отказ,Заголовок);
	КонецЕсли; 
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, Ложь);
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// БИТ_ЖКХ 16.06.2010 18:03:31 Начало вставки{
	// При обмене проверок не выполняем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 16.06.2010 18:03:36 Окончание вставки }
	
	// БИТ_ЖКХ добавление кода Начало: 03.09.2010 
	бит_ОбщегоНазначения.ПередЗаписьюДокументаДляУдаленияДвиженийПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	// БИТ_ЖКХ добавление кода конец : 03.09.2010 
	
	ТЗСписокЛС = ЛицевыеСчета.Выгрузить(,"ЛицевойСчет");
	НоваяСтрока = ТЗСписокЛС.Добавить();
	НоваяСтрока.ЛицевойСчет = ЛицевойСчет;
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// БИТ_ЖКХ_05122013_начало_изменений
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Заполнить реквизиты значениями по умолчанию.
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"), мВалютаРегламентированногоУчета, "");
	
	// БИТ_ЖКХ_30122013_начало_изменений
	// ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета;.
	Если ДанныеЗаполнения <> Неопределено Тогда
		
		Если ДанныеЗаполнения.Свойство("ВидОперации") Тогда
			
			ВидОперации = ДанныеЗаполнения.ВидОперации;
			
		КонецЕсли;
		
	Иначе
		
		ВидОперации = Перечисления.бит_ВидыОперацийУстановкаИзменениеУслугПоЛС.НазначениеУслугиНаЛицевыеСчета;
		
	КонецЕсли;
	// БИТ_ЖКХ_30122013_окончание_изменений
	
КонецПроцедуры
// БИТ_ЖКХ_05122013_окончание_изменений

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

#КонецОбласти
